import pandas as pd

# 최초 제공 정보 
menus = {'한식':[{'불고기': [0,'dsa'], '오징어 두루치기': [0,''], '닭볶음': [0,''], '쌈밥': [0,''], '비빔밥': [0,''], '생선구이': [0,''], '낚지볶음': [0,'d'], '게장': [0,''], '떡갈비': [0,'']}], 
           '찌개':[{'김치찌개': [0,'ggg'], '순두부찌개': [0,''], '된장찌개': ['0',''], '부대찌개': [0,''], '동태찌개': ['0',''], '청국장': [0,''], '갈비탕': [0,'d'], '추어탕': [0,''], '삼계탕': [0,'']}],
           '중식':[{'짜장면': [0,''], '짬뽕': [0,''], '볶음밥': [0,''], '탕수육': [0,''], '마파두부': [0,''], '양장피': [0,''], '깐풍기': [0,''], '유린기': [0,''], '고추잡채': [0,'']}],
           '양식':[{'토마토 스파게티': [0,'d'], ' 봉골레': [0,''], '크림파스타': [0,''], '피자': [0,''], '함박스테이크': [0,''], '리조또': [0,''], '스테이크': [0,''], '햄버거': [0,''], '시저 샐러드': [0,'']}],
           '일식':[{'초밥': [0,''], '라멘': [0,''], '낫또': [0,''], '오니기리': [0,''], '덮밥': [0,''], '우동': [0,''], '메밀소바': [0,''], '돈카츠': [0,'']}],
           '간편식':[{'편의점도시락': [0,''], '샌드위치': [0,''], '토스트': [0,''], '샐러드': [0,''], '김밥': [0,''], '떡볶이': [0,''], '핫도그': [0,''], '밥버거': [0,''], '시리얼': [0,'']}],
           '기타':[{'쌀국수': [0,''], '팟타이': [0,''], '카레': [0,''], '찜닭': [0,''], '수제비': [0,''], '칼국수': [0,''], '아구찜': [0,''], '닭갈비': [0,''], '월남쌈': [0,'']}]}



# 최초 파일 생성. (초기화)
# 카테고리/ 메뉴/ 레이팅/ 메모로 나눠 데이터 가공. 
if __name__ == "__main__":
    datas = []
    for category, menu_infos in menus.items():
        for menu_name,menu_info in menu_infos[0].items():
            row = {"Category": category, "Menu": menu_name,
                "Ratings":menu_info[0], "Memo":menu_info[1]}
            datas.append(row)

    df = pd.DataFrame(datas)
    # 테스트
    #print(df) 

    # csv파일 작성
    df.to_csv("menus.csv", encoding="utf8")

